In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
pop = pd.read_csv("../data/population.csv")

In [3]:
pop

                                   Total population  year  population
0                                          Abkhazia  1800         NaN
1                                       Afghanistan  1800   3280000.0
2                             Akrotiri and Dhekelia  1800         NaN
3                                           Albania  1800    410445.0
4                                           Algeria  1800   2503218.0
...                                             ...   ...         ...
22270                             Northern Marianas  2015         NaN
22271  South Georgia and the South Sandwich Islands  2015         NaN
22272                     US Minor Outlying Islands  2015         NaN
22273                                Virgin Islands  2015         NaN
22274                                     West Bank  2015         NaN

[22275 rows x 3 columns]

In [4]:
pop.columns = ["country","year","population"]

In [5]:
pop.head()

                 country  year  population
0               Abkhazia  1800         NaN
1            Afghanistan  1800   3280000.0
2  Akrotiri and Dhekelia  1800         NaN
3                Albania  1800    410445.0
4                Algeria  1800   2503218.0

In [6]:
pop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22275 entries, 0 to 22274
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     22275 non-null  object
 1   year        22275 non-null  int64
 2   population  20176 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 522.2+ KB

In [7]:
pop.isnull().sum()

country          0
year             0
population    2099
dtype: int64

In [8]:
pop = pop.dropna(axis ="rows")

In [9]:
pop

                         country  year  population
1                    Afghanistan  1800   3280000.0
3                        Albania  1800    410445.0
4                        Algeria  1800   2503218.0
5                 American Samoa  1800      8170.0
6                        Andorra  1800      2654.0
...                          ...   ...         ...
22256                     Zambia  2015  16211767.0
22257                   Zimbabwe  2015  15602751.0
22259                South Sudan  2015  12339812.0
22260                    Curaçao  2015    157203.0
22261  Sint Maarten (Dutch part)  2015     38745.0

[20176 rows x 3 columns]

In [10]:
pop.reset_index(drop = True ,inplace = True)

In [11]:
pop

                         country  year  population
0                    Afghanistan  1800   3280000.0
1                        Albania  1800    410445.0
2                        Algeria  1800   2503218.0
3                 American Samoa  1800      8170.0
4                        Andorra  1800      2654.0
...                          ...   ...         ...
20171                     Zambia  2015  16211767.0
20172                   Zimbabwe  2015  15602751.0
20173                South Sudan  2015  12339812.0
20174                    Curaçao  2015    157203.0
20175  Sint Maarten (Dutch part)  2015     38745.0

[20176 rows x 3 columns]

In [12]:
pop_1950 = pop[(pop["year"]>=1950)]

In [13]:
pop_1950

                         country  year  population
3435                 Afghanistan  1950   7752118.0
3436       Akrotiri and Dhekelia  1950     10661.0
3437                     Albania  1950   1263171.0
3438                     Algeria  1950   8872247.0
3439              American Samoa  1950     18937.0
...                          ...   ...         ...
20171                     Zambia  2015  16211767.0
20172                   Zimbabwe  2015  15602751.0
20173                South Sudan  2015  12339812.0
20174                    Curaçao  2015    157203.0
20175  Sint Maarten (Dutch part)  2015     38745.0

[16741 rows x 3 columns]

In [14]:
pop_1950.reset_index(drop = True ,inplace = True)

In [15]:
pop_1950

                         country  year  population
0                    Afghanistan  1950   7752118.0
1          Akrotiri and Dhekelia  1950     10661.0
2                        Albania  1950   1263171.0
3                        Algeria  1950   8872247.0
4                 American Samoa  1950     18937.0
...                          ...   ...         ...
16736                     Zambia  2015  16211767.0
16737                   Zimbabwe  2015  15602751.0
16738                South Sudan  2015  12339812.0
16739                    Curaçao  2015    157203.0
16740  Sint Maarten (Dutch part)  2015     38745.0

[16741 rows x 3 columns]

In [16]:
pop_1950.to_csv("../data/pop_1950.csv" , index = False)

In [ ]:
life = pd.read_excel ("../data/life_expectancy.xls")

In [ ]:
life.head()

In [ ]:
life.isnull().sum()

In [ ]:
life.info()

In [ ]:
life = life.dropna(axis ="rows")

In [ ]:
life

In [ ]:
life_1950 = life[(life["year"]>=1950)]

In [ ]:
life_1950.head()

In [ ]:
life_1950.reset_index(drop = True ,inplace = True)

In [ ]:
life_1950

In [ ]:
life_1950.columns = ["country","year","life expectancy"]

In [ ]:
life_1950

In [ ]:
life_1950.to_csv("../data/life_1950.csv" , index = False)

In [ ]:
fert= pd.read_csv("../data/fertility_rate.csv")

In [ ]:
fert.head()

In [ ]:
fert.info()

In [ ]:
fert.isnull().sum()

In [ ]:
fert = fert.dropna(axis ="rows")

In [ ]:
fert.info()

In [ ]:
fert_1950 = fert[(fert["year"]>=1950)]

In [ ]:
fert_1950.head()

In [ ]:
fert_1950.reset_index(drop = True ,inplace = True)

In [ ]:
fert_1950

In [ ]:
fert_1950.columns = ["country","year","fertility"]

In [ ]:
fert_1950

In [ ]:
fert_1950.to_csv("../data/fert_1950.csv", index = False)